{"title":"Doppelganger","authors":["Naomi Klein"],"description":"From the award-winning, bestselling author of No Logo, The Shock Doctrine, and This Changes Everything, a revelatory analysis of the collapsed meanings, blurred identities, and uncertain realities of the mirror world. “If ever a book was necessary, it’s this one.” —Bill McKibben “Thoughtful and honest . . . Incisive . . . Klein moves her reader toward the truer grounds of solidarity in these times.” —Judith Butler Over the past twenty-five years, Naomi Klein has charted and documented our politics and culture with a series of trenchant bestselling books laying bare the effects of branding, austerity, and climate profiteering on our societies and souls. With Doppelganger, Klein takes a more personal turn, braiding together elements of tragicomic memoir, chilling political reportage, and cobweb-clearing cultural analysis, as she dives deep into what she calls the Mirror World—our destabilized present rife with doubles and confusion, where far right movements playact solidarity with the working class, AI-generated content blurs the line between genuine and spurious, New Age wellness entrepreneurs turned anti-vaxxers further scramble our familiar political allegiances, and so many of us project our own carefully curated digital doubles out into the social media sphere. Klein begins this richly nuanced intellectual adventure story by grappling with her own doppelganger—a fellow author and public intellectual whose views are antithetical to Klein’s own, but whose name and public persona are sufficiently similar that many people have confused the two over the years. From there, she turns her gaze both inward to our psychic landscapes—drawing on the work of Sigmund Freud, Jordan Peele, Alfred Hitchcock, and bell hooks, to name a few—and outward, to our intersecting economic, environmental, medical, and political crises. Ultimately seeking to escape the Mirror World and chart a path beyond confusion and despair, Klein delivers a revelatory treatment of the way many of us think and feel now.","isbn":"9781039006904","thumbnail":"https://books.google.com/books/content?id=HH2-EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}
