{"isbn":"9780802161468","dateStarted":"2023-11-20","status":"started","rating":"unrated","title":"Hot Springs Drive","authors":["Lindsay Hunter"],"publishedDate":"2023-11-07","description":"The third title in Roxane Gay Books’ inaugural list, Hot Springs Drive is an urgent, vicious blade of a novel about a shocking betrayal and its aftermath, asking just how far you’ll go to have everything you want Jackie Stinson’s best friend is dead, and everyone knows who killed her. Jackie wants to be many things, but a martyr has never been one of them. She is an ex–emotional eater and mother of four, who has finally lost the weight she long yearned to be free of. In her new, sharp-edged body, she goes by Jacqueline. But leaving her old self behind proves harder than she ever imagined. And while she believes she should be happier, misery still chases her, and motherhood threatens to subsume what little is left of her. Jacqueline’s only salve is her best friend Theresa, whose seemingly perfect life she desperately covets. Since they met in the maternity ward fifteen years earlier, the two have survived the trials of motherhood side by side—Theresa with her quiet, cherubic daughter, and Jacqueline with her rambunctious, unruly boys. Their bond is tight, but it is not enough to keep Jacqueline, finally moving through the world in the body she has always wanted, from stealing a bit of Theresa’s perfect life. Hot Springs Drive is a dark, heart-pounding exploration of one woman’s deepest desires, and how the consequences of betrayal can ripple outward beyond the initial strike point. In her third and fiercest novel, acclaimed literary voice Lindsay Hunter deftly peels back the fragile veneer of two suburban families and the secrets roiling between them.","pageCount":212,"printType":"BOOK","categories":["Fiction"],"thumbnail":"https://books.google.com/books/content?id=2svfEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","language":"en","link":"https://play.google.com/store/books/details?id=2svfEAAAQBAJ"}
