{"title":"VenCo","authors":["Cherie Dimaline"],"description":"From the bestselling author of Empire of Wild, a wickedly subversive, deliciously imaginative, deeply feminist novel of contemporary witches on the rise—a book that only the supremely gifted storyteller Cherie Dimaline could write. Lucky St. James, orphaned daughter of a bad-ass Métis good-times girl, is barely hanging on to her nowhere life when she finds out that she and her grandmother, Stella, are about to be evicted from their apartment. Bad to worse in a heartbeat. Then one night, doing laundry in the building's dank basement, Lucky feels an irresistible something calling to her. Crawling through a hidden hole in the wall, she finds a tarnished silver spoon depicting a story-book hag over letters that spell out S-A-L-E-M. Which alerts Salem-born Meena Good, finder of a matching spoon, to Lucky's existence. One of the most powerful witches in North America, Meena has been called to bring together seven special witches and seven special spoons—infused with magic and scattered to the four directions more than a century ago—to form a magic circle that will restore women to their rightful power. Under the wing of the international headhunting firm VenCo, devoted to placing exceptional women in roles where they can influence business, politics and the arts, Meena has spent years searching out witches hiding in plain sight wherever women gather: suburban book clubs, Mommy & Me groups, temp agencies. Lucky and her spoon are number six. With only one more spoon to find, a very powerful adversary has Meena's coven in his sights—Jay Christos, a roguish and deadly witch-hunter as old as witchcraft itself. As the clock ticks toward a now-or-never deadline, Meena sends Lucky and her grandmother on a dangerous, sometimes hilarious, road trip through the United States in search of the seventh spoon. The trail leads them at last to the darkly magical city of New Orleans, where Lucky's final showdown with Jay Christos will determine whether the coven will be completed, ushering in a new beginning, or whether witches will be forced to remain forever underground.","isbn":"9780735277229","thumbnail":"https://books.google.com/books/content?id=r0Z4EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}
