{"isbn":"9781984881670","dateStarted":"2023-11-05","status":"started","rating":"unrated","title":"The Push","authors":["Ashley Audrain"],"publishedDate":"2021-01-05","description":"A GOOD MORNING AMERICA BOOK CLUB PICK \"An intense psychological drama that will be embraced by serious book clubs and fans of Lionel Shriver's We Need to Talk about Kevin.\" —Kristin Hannah, #1 New York Times bestselling author \"A poetic, propulsive read that set my nerves jangling.\" —Lisa Jewell, #1 New York Times bestselling author of Then She Was Gone A tense, page-turning psychological drama about the making and breaking of a family—and a woman whose experience of motherhood is nothing at all what she hoped for—and everything she feared Blythe Connor is determined that she will be the warm, comforting mother to her new baby Violet that she herself never had. But in the thick of motherhood's exhausting early days, Blythe becomes convinced that something is wrong with her daughter—she doesn't behave like most children do. Or is it all in Blythe's head? Her husband, Fox, says she's imagining things. The more Fox dismisses her fears, the more Blythe begins to question her own sanity, and the more we begin to question what Blythe is telling us about her life as well. Then their son Sam is born—and with him, Blythe has the blissful connection she'd always imagined with her child. Even Violet seems to love her little brother. But when life as they know it is changed in an instant, the devastating fall-out forces Blythe to face the truth. The Push is a tour de force you will read in a sitting, an utterly immersive novel that will challenge everything you think you know about motherhood, about what we owe our children, and what it feels like when women are not believed.","pageCount":349,"printType":"BOOK","categories":["Fiction"],"thumbnail":"https://books.google.com/books/content?id=A9XdDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","language":"en","link":"https://play.google.com/store/books/details?id=A9XdDwAAQBAJ"}
