{"title":"Bridge","authors":["Lauren Beukes"],"description":"A grieving daughter’s search for her mother becomes a journey across alternate realities in this dazzling new thriller from the author of The Shining Girls that is \"sheer thrilling madness with a big, beating heart that reminds us we're all connected\" (Grady Hendrix, New York Times bestselling author). There are infinite realities. She's looking for one . . . Twenty-four-year-old Bridge is paralyzed by choices: all the other lives she could have lived, the decisions she could have made. And now, who she should be in the wake of her mother’s unexpected death. Jo was a maverick neuroscientist fixated on an artifact she called the “dreamworm” that she believed could open the doors to other worlds. It was part of Jo’s grand delusion, her sickness, and it cost her everything, including her relationship with her daughter. But in packing up Jo’s house, Bridge discovers Jo’s obsession hidden amongst her things. And the dreamworm works, exactly the way it’s supposed to, the way Bridge remembers from when she was a little girl. Suddenly Bridge can step into other realities, otherselves. In one of them, could she find out what really happened to her mother? What Bridge doesn’t know is that there are others hunting for the dreamworm—who will kill to get their hands on it. Bridge is a highly original, reality-bending thrill-ride that could only have come from the brilliant mind of award-winning novelist, Lauren Beukes, about mothers and daughters, hunters and seekers, and who we each choose to be. \"A fantastic high-wire act of a novel . . . at once a cosmic narrative and a deeply intimate human story.\" —Catriona Ward \"Ass-kicking, mind-bending entertainment.\" —Kirkus Reviews “A suspenseful, deeply immersive odyssey that will make you consider the alternate possibilities inside us all.” —Katie Gutierrez \"Spiders out into alternate universes yet manages to be very much about us and our fractured now.\" —Paul Tremblay \"Lauren Beukes is a major, major talent.\" —George R. R. Martin","isbn":"9780316267878","thumbnail":"https://books.google.com/books/content?id=e_mfEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}
