{"title":"Hold Me Tight","authors":["Dr. Sue Johnson"],"description":"Strengthen and deepen your relationships with this \"much-needed\" (Harville Hendrix, PhD) guide that has sold over one million copies, through revelatory practical exercises, seven profound conversations, and sage advice from “the best couple’s therapist in the world” (John Gottman, PhD, bestselling author) Are you looking to enrich a healthy relationship, revitalize a tired one, or rescue one gone awry? We all want a lifetime of love, support, and companionship. But sometimes we need a little help. Enter Dr. Sue Johnson, developer of Emotionally Focused Couple Therapy and “the most original contributor to couple’s therapy to come along in the last thirty years,” according to Dr. William J. Doherty, PhD. In Hold Me Tight, Dr. Johnson shares her groundbreaking and remarkably successful program for creating stronger, more secure relationships. The message of Hold Me Tight is simple: Forget about learning how to argue better, analyzing your early childhood, making grand romantic gestures, or experimenting with new sexual positions. Instead, get to the emotional underpinnings of your relationship by recognizing that you are emotionally attached to and dependent on your partner in much the same way that a child is on a parent for nurturing, soothing, and protection. Dr. Johnson teaches that the way to enhance or save a relationship is to be open, attuned, and responsive to each other and to reestablish emotional connection. With this in mind, she focuses on key moments in a relationship and uses them as touch points for seven healing conversations, including: Recognizing the Demon Dialogues Finding the Raw Spots Revisiting a Rocky Moment Forgiving Injuries Keeping Your Love Alive These conversations give you insight into the defining moments in your relationship and guide you in reshaping these moments to create a secure and lasting bond. Through stories from Dr. Johnson’s practice, illuminating advice, and practical exercises, you will learn how to nurture, protect, and grow your relationship, ensuring a lifetime of love.","isbn":"9780316031998","thumbnail":"https://books.google.com/books/content?id=jPLaqKhumPQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}
