{"title":"Come Together","authors":["Emily Nagoski, PhD"],"description":"From the New York Times bestselling author of Come as You Are and co-author of Burnout comes an illuminating exploration of how to maintain a happy sex life in a long-term relationship. “Emily Nagoski is a national treasure—helping us all understand how to finally build true, joyful, confident sex lives.”—Glennon Doyle, author of Untamed In Come as You Are, Emily Nagoski, PhD, revolutionized the way we think about women’s sexuality. Now, in Come Together, Nagoski takes on a fundamentally misunderstood subject: sex in long-term relationships. Most of us struggle at some point to maintain a sexual connection with our partner/s or spouse. And many of us are given not-very-good advice on what to do about it. In this book, Nagoski dispels the myths we’ve been taught about sex—for instance, the belief that sexual satisfaction and desire are highest at the beginning of a relationship and that they inevitably decline the longer that relationship lasts. Nagoski assures us that’s not true. So, what is true? Come Together isn’t about how much we want sex, or how often we’re having it; it’s about whether we like the sex we’re having. Nagoski breaks down the obstacles that impede us from enjoying sex—from stress and body image to relationship difficulties and gendered beliefs about how sex “should” be—and presents the best ways to overcome them. You’ll learn: • that “spontaneous desire” is not the kind of desire to strive for if you want to have great sex for decades • vocabulary for talking with partners about ways to get in “the mood” and how to not take it personally when “the mood” is nowhere to be found • how to understand your own and your partner’s “emotional floorplan,” so that you have a blueprint for how to get to a sexy state of mind Written with scientific rigor, humor, and compassion, Nagoski shows us what great sex can look like, how to create it in our own lives, and what to do when struggles arise.","isbn":"9780593500842","thumbnail":"https://books.google.com/books/content?id=Ar-SEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}
