{"isbn":"9780857308443","dateStarted":"2023-12-09","status":"started","rating":"unrated","title":"Just Like Mother","authors":["Anne Heltzel"],"publishedDate":"2023-04-11","description":"The last time Maeve saw her cousin was the night she escaped the cult they were raised in. For the past two decades, Maeve has worked hard to build a normal life in New York City, where she keeps everything - and everyone - at a safe distance. When Andrea suddenly reappears, Maeve regains the only true friend she's ever had. Soon she's spending more time at Andrea's remote Catskills estate than in her own cramped apartment. Maeve doesn't even mind that her cousin's wealthy work friends clearly disapprove of her single lifestyle. After all, Andrea has made her fortune in the fertility industry - baby fever comes with the territory. What worries Maeve is that the more she immerses herself in Andrea's world, the more her long-buried memories flood to the surface. But confronting the terrors of her childhood may be the only way for Maeve to transcend the nightmare still to come... Spine-chilling and sharp, Just Like Mother is a modern gothic from a fresh new voice in horror, perfect for fans of Jessamine Chan’s The School for Good Mothers, Emma Cline’s The Girls and Christina Dalcher’s Femlandia. 'Set to be one of the year's most talked about books. I tore through this urgent, timely, and deeply disturbing tale... And I'll think of it every time I field an uncomfortable question about my own childless status' - Andrea Bartz 'A fierce, frightening novel that examines autonomy, motherhood, and the dark side of feminine power with savage precision. A total thrill ride' - Rachel Harrison 'Lyrical and grotesque, Just Like Mother is written in gorgeous and shattering prose' - CrimeReads","pageCount":246,"printType":"BOOK","categories":["Fiction"],"thumbnail":"https://books.google.com/books/content?id=Ee-yEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","language":"en","link":"https://books.google.com/books/about/Just_Like_Mother.html?hl=&id=Ee-yEAAAQBAJ"}
