{"isbn":"9780593233689","dateStarted":"2023-11-12","status":"started","rating":"unrated","title":"Us","authors":["Terrence Real"],"publishedDate":"2022-06-07","description":"NEW YORK TIMES, WALL STREET JOURNAL, AND USA TODAY BESTSELLER • Stop working on yourself as an individual and start working on your relationship as a couple, with the help of the renowned family therapist and author of The New Rules of Marriage “This book is a road map for all of us who seek true intimacy.”—GWYNETH PALTROW, founder and CEO of goop Not much is harder than figuring out how to love your partner in all their messy humanness—and there’s also not much that’s more important. At a time when toxic individualism is rending our society at every level, bestselling author and renowned marriage counselor Terrence Real sees how it poisons intimate relationships in his therapy practice, where he works with couples on the brink of disaster. The good news: Warmer, closer, more passionate relationships are possible if you have the right tools. In his transformative new book Us, Real brilliantly observes how our winner-takes-all culture infiltrates families with devastating results: repetitive fights that go nowhere, or a distant relationship in which partners end up living “alone together.” With deft insight, humor, and charm, Real guides you to transform your relationship into one that’s based on compassion, collaboration, and closeness. Us is a groundbreaking guide to a new science-backed skillset—one that will allow you to get past your knee-jerk reactions and tap into your wiser, more collaborative self. With a novelist’s flair, Real shares the stories of couples whose relationships have been saved by these skills and pans out to the culture that reinforces our dysfunction. If you and your partner are backed into separate corners of “you” and “me,” this book will show the way back to “us.” With Us, your true relationship can begin.","pageCount":202,"printType":"BOOK","categories":["Family & Relationships"],"thumbnail":"https://books.google.com/books/content?id=wG00EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","language":"en","link":"https://play.google.com/store/books/details?id=wG00EAAAQBAJ"}
