{"title":"Your Brain on Art","authors":["Susan Magsamen","Ivy Ross"],"description":"NEW YORK TIMES BESTSELLER • A life-altering journey through the science of neuroaesthetics, which offers proof for how our brains and bodies transform when we participate in the arts—and how this knowledge can improve our health, enable us to flourish, and build stronger communities. “This book blew my mind!”—Angela Duckworth, #1 New York Times bestselling author of Grit Many of us think of the arts as entertainment—a luxury of some kind. In Your Brain on Art, authors Susan Magsamen and Ivy Ross show how activities from painting and dancing to expressive writing, architecture, and more are essential to our lives. We’re on the verge of a cultural shift in which the arts can deliver potent, accessible, and proven solutions for the well-being of everyone. Magsamen and Ross offer compelling research that shows how engaging in an art project for as little as forty-five minutes reduces the stress hormone cortisol, no matter your skill level, and just one art experience per month can extend your life by ten years. They expand our understanding of how playing music builds cognitive skills and enhances learning; the vibrations of a tuning fork create sound waves to counteract stress; virtual reality can provide cutting-edge therapeutic benefit; and interactive exhibits dissolve the boundaries between art and viewers, engaging all of our senses and strengthening memory. Doctors have even been prescribing museum visits to address loneliness, dementia, and many other physical and mental health concerns. Your Brain on Art is a portal into this new understanding about how the arts and aesthetics can help us transform traditional medicine, build healthier communities, and mend an aching planet. Featuring conversations with artists such as David Byrne, Renée Fleming, and evolutionary biologist E. O. Wilson, Your Brain On Art is an authoritative guide to neuroaesthetics. The book weaves a tapestry of breakthrough research, insights from multidisciplinary pioneers, and compelling stories from people who are using the arts to enhance their lives.","isbn":"9780593449233","thumbnail":"https://books.google.com/books/content?id=3PB8EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}
